"""
Лабораторная работа №3: Матрицы в 3D-графике
Задание 7: Реализация перспективы
"""

import numpy as np
import matplotlib.pyplot as plt
from mpl_toolkits.mplot3d.art3d import Poly3DCollection
import os

# Создаём папки для данных
os.makedirs('img', exist_ok=True)

# ============================== ФУНКЦИИ ДЛЯ ЗАДАНИЯ 7 ==============================

def load_task6_data():
    """
    Загрузка данных из задания 6
    """
    try:
        data = np.load('data/task6_data.npz', allow_pickle=True)
        cubes_vertices = data['cubes_vertices']
        cubes_colors = data['cubes_colors']
        faces = data['faces']
        C = data['C']
        C_inv = data['C_inv']

        cubes = [(cubes_vertices[i], cubes_colors[i]) for i in range(len(cubes_vertices))]
        return cubes, faces, C, C_inv
    except Exception as e:
        print(f"⚠️ Не удалось загрузить данные задания 6: {e}")
        print("Создаём тестовую сцену...")
        return create_test_scene()

def create_test_scene():
    """
    Создание тестовой сцены, если не удалось загрузить данные из задания 6
    """
    def create_cube(center=(0, 0, 0), size=2):
        cx, cy, cz = center
        half = size / 2
        vertices = np.array([
            [cx - half, cx + half, cx + half, cx - half,
             cx - half, cx + half, cx + half, cx - half],
            [cy - half, cy - half, cy + half, cy + half,
             cy - half, cy - half, cy + half, cy + half],
            [cz - half, cz - half, cz - half, cz - half,
             cz + half, cz + half, cz + half, cz + half],
            [1, 1, 1, 1, 1, 1, 1, 1]
        ], dtype=np.float64)
        faces = np.array([
            [0, 1, 2, 3], [4, 5, 6, 7], [0, 1, 5, 4],
            [2, 3, 7, 6], [1, 2, 6, 5], [0, 3, 7, 4]
        ])
        return vertices, faces

    # Создаём несколько кубов для сцены
    cube1, faces = create_cube(center=(0, 0, 0), size=2)
    cube2, _ = create_cube(center=(3, 0, 0), size=1.5)
    cube3, _ = create_cube(center=(0, 3, 0), size=1.2)
    cube4, _ = create_cube(center=(-2, -2, 2), size=0.8)

    cubes = [
        (cube1, 'lightblue'),
        (cube2, 'lightgreen'),
        (cube3, 'lightcoral'),
        (cube4, 'lightgoldenrodyellow')
    ]

    # Создаём тестовую матрицу камеры
    C = np.eye(4)
    C_inv = np.eye(4)

    return cubes, faces, C, C_inv

def draw_shape_perspective(ax, vertices, faces, color='lightblue', alpha=0.7):
    """
    Отрисовка фигуры с обработкой перспективы
    """
    # Обрабатываем однородные координаты с защитой от деления на ноль
    w = vertices[3, :]
    w_safe = np.where(np.abs(w) < 1e-8, 1e-8, w)
    cartesian_vertices = (vertices[:3, :] / w_safe).T

    # Создаём полигонную коллекцию
    poly = Poly3DCollection(
        cartesian_vertices[faces],
        facecolors=color,
        edgecolors='darkblue',
        linewidths=0.6,
        alpha=alpha,
        shade=True
    )
    ax.add_collection3d(poly)
    return cartesian_vertices

def setup_3d_view(ax, elev=25, azim=-45):
    """
    Настройка угла обзора камеры
    """
    ax.view_init(elev=elev, azim=azim)

def create_perspective_matrix(fov_deg=60.0, aspect=1.0, near=0.5, far=20.0):
    """
    Создание матрицы перспективы (OpenGL-стиль)

    Parameters:
    -----------
    fov_deg : float
        Вертикальный угол обзора в градусах
    aspect : float
        Соотношение сторон (ширина/высота)
    near : float
        Расстояние до ближней плоскости отсечения
    far : float
        Расстояние до дальней плоскости отсечения

    Returns:
    --------
    P : np.ndarray
        Матрица перспективы 4x4
    """
    # Конвертируем угол обзора в радианы
    fov_rad = np.radians(fov_deg)
    f = 1.0 / np.tan(fov_rad / 2.0)

    # Инициализируем матрицу
    P = np.zeros((4, 4), dtype=np.float64)

    # Заполняем матрицу
    P[0, 0] = f / aspect
    P[1, 1] = f
    P[2, 2] = -(far + near) / (far - near)
    P[2, 3] = -(2.0 * far * near) / (far - near)
    P[3, 2] = -1.0

    return P

def apply_perspective(vertices, P):
    """
    Применение матрицы перспективы к вершинам
    """
    return P @ vertices

# ============================== ТЕОРИЯ И РАСЧЁТЫ ==============================

def print_theory_perspective():
    """
    Вывод теоретической информации о перспективе
    """
    print("\n" + "="*60)
    print("ТЕОРЕТИЧЕСКАЯ ЧАСТЬ: МАТРИЦА ПЕРСПЕКТИВЫ")
    print("="*60)

    print("\n1. Общая форма матрицы перспективы (OpenGL-стиль):")
    print("   ⎡ f/aspect   0        0             0       ⎤")
    print("   ⎢   0        f        0             0       ⎥")
    print("   ⎢   0        0   -(f+n)/(f-n)  -2fn/(f-n) ⎥")
    print("   ⎣   0        0       -1             0       ⎦")
    print("   где f = 1/tan(fov/2), n = near, f = far")

    print("\n2. Геометрическая интерпретация:")
    print("   • Матрица перспективы преобразует усечённый конус видимости (frustum)")
    print("     в куб с координатами [-1, 1] по всем осям")
    print("   • После применения матрицы P, компонента w становится равной -z")
    print("   • При преобразовании в декартовы координаты (деление на w)")
    print("     получаем нелинейное преобразование: (x/z, y/z)")
    print("   • Это создаёт эффект: дальние объекты кажутся меньше")

    print("\n3. Параметры перспективы:")
    print("   • FOV (Field of View) - вертикальный угол обзора")
    print("   • Aspect ratio - соотношение сторон (ширина/высота)")
    print("   • Near/Far - ближняя и дальняя плоскости отсечения")
    print("   • Большой FOV → 'широкоугольный' эффект с искажениями по краям")
    print("   • Маленький FOV → 'телеобъектив', сжатая перспектива")

    print("\n4. Алгебраические свойства:")
    print("   • Перспектива - проективное преобразование, а не аффинное")
    print("   • Не сохраняет параллельность линий")
    print("   • Точки на бесконечности отображаются в конечные точки")
    print("   • Является частным случаем проективного преобразования")

# ============================== ЗАДАНИЕ 7 ==============================

def task7():
    """
    Задание 7: Реализация перспективы
    """
    print("="*60)
    print("ЗАДАНИЕ 7: РЕАЛИЗАЦИЯ ПЕРСПЕКТИВЫ")
    print("="*60)

    # Загрузка сцены из задания 6
    print("\n📦 Загрузка сцены из задания 6...")
    cubes, faces, C, C_inv = load_task6_data()
    print(f"   Загружено: {len(cubes)} кубиков")

    # Вывод теоретической информации
    print_theory_perspective()

    # ==================== ЧАСТЬ 1: ПАРАМЕТРЫ ПЕРСПЕКТИВЫ ====================
    print("\n" + "="*60)
    print("ЧАСТЬ 1: ПАРАМЕТРЫ ПЕРСПЕКТИВЫ И СОЗДАНИЕ МАТРИЦЫ")
    print("="*60)

    # Параметры перспективы
    fov = 60.0    # Угол обзора в градусах
    aspect = 1.0  # Соотношение сторон
    near = 0.5    # Ближняя плоскость
    far = 20.0    # Дальняя плоскость

    print(f"\n1. Выбранные параметры перспективы:")
    print(f"   • FOV: {fov}°")
    print(f"   • Aspect ratio: {aspect}")
    print(f"   • Near plane: {near}")
    print(f"   • Far plane: {far}")

    # Создание матрицы перспективы
    P = create_perspective_matrix(fov_deg=fov, aspect=aspect, near=near, far=far)
    print(f"\n2. Матрица перспективы P:")
    print(P)

    # Применение перспективы ко всем кубикам
    print("\n3. Применение матрицы перспективы ко всем объектам сцены:")
    perspective_cubes = []
    for i, (vertices, color) in enumerate(cubes):
        persp_vertices = apply_perspective(vertices, P)
        perspective_cubes.append((persp_vertices, color))
        print(f"   • Кубик {i+1}: перспектива применена")

    # ==================== ЧАСТЬ 2: СРАВНЕНИЕ ПРОЕКЦИЙ ====================
    print("\n" + "="*60)
    print("ЧАСТЬ 2: СРАВНЕНИЕ ОРТОГОНАЛЬНОЙ И ПЕРСПЕКТИВНОЙ ПРОЕКЦИЙ")
    print("="*60)

    print("\n4. Визуализация сравнения проекций:")

    # Создаём фигуру с двумя подграфиками
    fig, axes = plt.subplots(1, 2, figsize=(15, 7), subplot_kw={'projection': '3d'})

    # Ортогональная проекция (оригинальная сцена)
    ax = axes[0]
    ax.set_box_aspect([1, 1, 1])
    ax.set_xlim(-4, 6)
    ax.set_ylim(-4, 6)
    ax.set_zlim(-3, 5)
    ax.grid(True)
    setup_3d_view(ax, elev=25, azim=-45)
    ax.set_xlabel('X')
    ax.set_ylabel('Y')
    ax.set_zlabel('Z')

    for vertices, color in cubes:
        draw_shape_perspective(ax, vertices, faces, color, alpha=0.7)

    ax.set_title("Ортогональная проекция\n(без перспективы)", fontsize=12, pad=15)

    # Перспективная проекция
    ax = axes[1]
    ax.set_box_aspect([1, 1, 1])
    ax.set_xlim(-2, 4)
    ax.set_ylim(-2, 4)
    ax.set_zlim(-2, 2)
    ax.grid(True)
    setup_3d_view(ax, elev=25, azim=-45)
    ax.set_xlabel('X')
    ax.set_ylabel('Y')
    ax.set_zlabel('Z')

    for vertices, color in perspective_cubes:
        draw_shape_perspective(ax, vertices, faces, color, alpha=0.7)

    ax.set_title("Перспективная проекция\n(FOV=60°)", fontsize=12, pad=15)

    plt.tight_layout()
    plt.savefig('img/task7_orthographic_vs_perspective.png', dpi=150, bbox_inches='tight', pad_inches=0.1)
    print("   Сохранено: img/task7_orthographic_vs_perspective.png")
    plt.show()

    # ==================== ЧАСТЬ 3: ИССЛЕДОВАНИЕ ДЕФОРМАЦИИ ПРОСТРАНСТВА ====================
    print("\n" + "="*60)
    print("ЧАСТЬ 3: ИССЛЕДОВАНИЕ ДЕФОРМАЦИИ ПРОСТРАНСТВА ПРИ ВРАЩЕНИИ")
    print("="*60)

    print("\n5. Демонстрация деформации пространства при разных углах обзора:")

    # Задаём разные углы обзора
    views = [
        (25, -45),   # Стандартный вид
        (25, 45),    # Вид с другой стороны
        (60, -45),   # Вид сверху
        (-20, -45)   # Вид снизу
    ]

    # Создаём фигуру 2x2
    fig, axes = plt.subplots(2, 2, figsize=(14, 12), subplot_kw={'projection': '3d'})
    fig.suptitle("Эффекты перспективы при разных углах обзора\n(FOV=60°)", fontsize=16, y=0.98)

    for idx, (elev, azim) in enumerate(views):
        row = idx // 2
        col = idx % 2
        ax = axes[row, col]

        # Настройка осей
        ax.set_box_aspect([1, 1, 1])
        ax.set_xlim(-2, 4)
        ax.set_ylim(-2, 4)
        ax.set_zlim(-2, 2)
        ax.grid(True)
        setup_3d_view(ax, elev=elev, azim=azim)
        ax.set_xlabel('X')
        ax.set_ylabel('Y')
        ax.set_zlabel('Z')

        # Отрисовка кубиков
        for vertices, color in perspective_cubes:
            draw_shape_perspective(ax, vertices, faces, color, alpha=0.7)

        ax.set_title(f"elev={elev}°, azim={azim}°", fontsize=12, pad=10)

    plt.tight_layout(rect=[0, 0, 1, 0.96])
    plt.savefig('img/task7_perspective_rotations.png', dpi=150, bbox_inches='tight', pad_inches=0.1)
    print("   Сохранено: img/task7_perspective_rotations.png")
    plt.show()

    # ==================== ЧАСТЬ 4: АНАЛИЗ РЕЗУЛЬТАТОВ ====================
    print("\n" + "="*60)
    print("ЧАСТЬ 4: АНАЛИЗ РЕЗУЛЬТАТОВ")
    print("="*60)

    print("\n6. Анализ полученных результатов:")

    # 4.1 Анализ эффекта перспективы
    print("\n   а) Эффект перспективы:")
    print("   • Кубики, расположенные дальше от камеры, выглядят меньше")
    print("   • Параллельные рёбра, уходящие вглубь сцены, сходятся")
    print("   • Создаётся иллюзия глубины пространства")

    # 4.2 Анализ влияния параметров
    print("\n   б) Влияние параметров перспективы:")
    print("   • FOV=60° обеспечивает естественное восприятие глубины")
    print("   • Near=0.5 исключает слишком близкие объекты от искажений")
    print("   • Far=20.0 ограничивает видимую область сцены")

    # 4.3 Анализ деформации при вращении
    print("\n   в) Деформация при вращении:")
    print("   • При увеличении угла обзора (elev=60°) усиливается эффект перспективы")
    print("   • При виде снизу (elev=-20°) кубики, близкие к камере, сильно доминируют")
    print("   • При вращении по азимуту (azim=45°) меняется видимость объектов")

    # 4.4 Сравнение с ортогональной проекцией
    print("\n   г) Сравнение с ортогональной проекцией:")
    print("   • В ортогональной проекции все кубики имеют одинаковый размер")
    print("   • В перспективной проекции размер зависит от расстояния до камеры")
    print("   • Перспектива создаёт более реалистичное восприятие глубины")

    # ==================== ЧАСТЬ 5: ВЫВОДЫ ====================
    print("\n" + "="*60)
    print("ЧАСТЬ 5: ВЫВОДЫ")
    print("="*60)

    print("\n1. Теоретические аспекты:")
    print("   • Матрица перспективы реализует проективное преобразование")
    print("   • Ключевой механизм - деление на компоненту w (эквивалентно делению на z)")
    print("   • Преобразование зависит от выбранных параметров (FOV, aspect, near, far)")

    print("\n2. Практические результаты:")
    print("   • Эффект перспективы успешно реализован")
    print("   • Дальние объекты выглядят меньше, что создаёт ощущение глубины")
    print("   • Параллельные линии сходятся, имитируя реальное зрение")
    print("   • Эффект усиливается при увеличении FOV и изменении угла обзора")

    print("\n3. Сравнение проекций:")
    print("   • Ортогональная проекция сохраняет пропорции и параллельность")
    print("   • Перспективная проекция искажает пропорции для создания глубины")
    print("   • Выбор типа проекции зависит от задачи (технические чертежи vs реалистичные изображения)")

    print("\n4. Практическое значение:")
    print("   • Перспектива - ключевое преобразование в 3D-рендеринге")
    print("   • Используется во всех современных играх и графических приложениях")
    print("   • Является основой для создания реалистичных визуализаций")

    print("\n" + "="*60)
    print("ЗАДАНИЕ 7 ВЫПОЛНЕНО")
    print("="*60)

    # Сохранение данных для возможных следующих заданий
    np.savez('data/task7_data.npz',
            cubes_vertices=[c[0] for c in cubes],
            persp_cubes_vertices=[c[0] for c in perspective_cubes],
            cubes_colors=[c[1] for c in cubes],
            faces=faces,
            P=P)
    print("\nДанные сохранены в data/task7_data.npz")

    return perspective_cubes, P

# ============================== ЗАПУСК ==============================

if __name__ == "__main__":
    # Запускаем задание 7
    perspective_cubes, P = task7()